In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/atomikkus/price_prediction_of_used_cars/main/Dataset/Cars24.csv', index_col=0)

In [13]:
df.head(10)

,Car Brand,Model,Price,Model Year,Location,Fuel,Driven (Kms),Gear,Ownership,EMI (monthly)
0,Hyundai,EonERA PLUS,330399,2016,Hyderabad,Petrol,10674,Manual,2,7350
1,Maruti,Wagon R 1.0LXI,350199,2011,Hyderabad,Petrol,20979,Manual,1,7790
2,Maruti,Alto K10LXI,229199,2011,Hyderabad,Petrol,47330,Manual,2,5098
3,Maruti,RitzVXI BS IV,306399,2011,Hyderabad,Petrol,19662,Manual,1,6816
4,Tata,NanoTWIST XTA,208699,2015,Hyderabad,Petrol,11256,Automatic,1,4642
5,Maruti,AltoLXI,249699,2012,Hyderabad,Petrol,28434,Manual,1,5554
6,Maruti,AltoLXI,240599,2011,Hyderabad,Petrol,31119,Manual,1,5352
7,Maruti,Alto K10LXI,191999,2010,Hyderabad,Petrol,10910,Manual,1,4271
8,Honda,Brio1.2 S MT I VTEC,362299,2013,Hyderabad,Petrol,40362,Manual,2,8059
9,Maruti,Wagon R 1.0VXI,385799,2014,Hyderabad,Petrol,15673,Manual,2,8582

# Preprocessing

In [12]:
df.isnull().sum() # Check for  missing values

Car Brand          0
Model            265
Price              0
Model Year         0
Location           0
Fuel               0
Driven (Kms)       0
Gear             265
Ownership          0
EMI (monthly)      0
dtype: int64

In [32]:
cat_cols = ['Car Brand', 'Model', 'Location', 'Fuel', 'Gear', 'Ownership']

for i in cat_cols:
    print(df[i].value_counts())

Maruti        2819
Hyundai       1281
Honda          465
Toyota         301
Volkswagen     192
Renault        174
Mahindra       143
Ford           142
Tata            91
Skoda           51
Mercedes        34
Nissan          33
Chevrolet       32
BMW             26
Audi            25
Datsun          24
MG              21
KIA             21
Jeep            15
Fiat            12
Landrover        5
Ssangyong        3
Jaguar           3
Mitsubishi       2
Volvo            1
ISUZU            1
TOYOTA           1
Name: Car Brand, dtype: int64
Alto 800LXI               184
Wagon R 1.0VXI            177
Alto K10VXI               156
SwiftVDI                  137
SwiftVXI                  135
                         ...
TIAGO NRGPETROL             1
Kuv100K8 D 6 STR            1
Santro XingGL CNG           1
CityVX MT O DIESEL          1
i10SPORTZ 1.2 KAPPA2 O      1
Name: Model, Length: 902, dtype: int64
Delhi        2312
Mumbai       1760
Bangalore     822
Chennai       614
Hyderabad     410
Name: Location, dtype: int64
Petrol          3787
Diesel          1964
Petrol + CNG     147
Petrol + LPG      18
Electric           2
Name: Fuel, dtype: int64
Manual       5075
Automatic     578
Name: Gear, dtype: int64
1    4448
2    1264
3     191
4      15
Name: Ownership, dtype: int64

In [16]:
df.describe() # descriptive stats for referance

              Price   Model Year   Driven (Kms)    Ownership  EMI (monthly)
count  5.918000e+03  5918.000000    5918.000000  5918.000000    5918.000000
mean   5.180530e+05  2014.547651   60842.778979     1.285738   11523.801284
std    3.224695e+05     2.905185   42362.990292     0.532820    7173.156118
min    9.100000e+04  2007.000000     179.000000     1.000000    2024.000000
25%    3.205240e+05  2012.000000   30856.000000     1.000000    7129.750000
50%    4.303990e+05  2015.000000   53514.000000     1.000000    9574.000000
75%    6.157990e+05  2017.000000   81979.250000     1.000000   13698.000000
max    6.500000e+06  2021.000000  912380.000000     4.000000  144589.000000

#### We have to feature engineer the Model column as it gives two types of Info, one  is about the model itself and another is about the sub-model sort

In [57]:
def make_model(string):

    make = string.split()[0]
    model = ' '.join(string.split()[1:])
    
    return make, model

In [61]:
# Testing
make_model('NanoTWIST XTA')

('NanoTWIST', 'XTA')

In [59]:
df[['Make', 'Model']]=df['Model'].astype('str').apply(make_model).apply(pd.Series)

#### Dropping Useless columns for analysis

In [67]:
df.drop(['EMI (monthly)'], axis=1, inplace=True)

In [68]:
df['Total_price']=df.pop('Price')

In [70]:
df['Make'].value_counts()

Alto         455
Swift        342
Wagon        289
nan          265
Grand        208
            ...
Safari         1
XFPETROL       1
Sonata2.4      1
ScalaRXZ       1
BoltXT         1
Name: Make, Length: 351, dtype: int64